**`commonimages/base/rhel_7_9`** terraform plan on `pull_request` event [#25](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 3s
data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
data.aws_secretsmanager_secret_version.environment_management: Reading...
data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 0s [id=<REDACTED>]
data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Read complete after 1s [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["../components/ansible.yml.tftpl"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: base_rhel_7_9_ansible
            description: Install ansible roles for base_rhel_7_9
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.0.1
                  description: Uses the recipe version to avoid any issues with the branch template arg.
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  # Install ansible roles
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          # do not set -u as it breaks on RedHat 6
                          set -e
                          run_ansible() {
                            repo="modernisation-platform-ami-builds"
                            ami_tag="base_rhel_7_9"
            
                            # clone ansible roles and playbook
                            ansible_dir=$(mktemp -d)
                            echo "Cloning $repo into $ansible_dir using branch=main"
                            cd $ansible_dir
                            git clone -b main "https://github.com/ministryofjustice/$repo.git"
            
                            # set python version
                            if [[ $(which python3.9 2> /dev/null) ]]; then
                              python=$(which python3.9)
                            elif [[ $(which python3.6 2> /dev/null) ]]; then
                              python=$(which python3.6)
                            else
                              echo "Python3.9/3.6 not found"
                              exit 1
                            fi
                            echo "python: $python"
            
                            # install python dependencies outside of virtual env so ansible
                            # can be executed remotely
                            cd $ansible_dir/$repo/ansible
                            $python -m pip install -r requirements.txt
            
                            # activate virtual environment
                            mkdir $ansible_dir/python-venv && cd "$_"
                            $python -m venv ansible
                            source ansible/bin/activate
                            $python -m pip install --upgrade pip
                            if [[ "$python" =~ 3.6 ]]; then
                              $python -m pip install wheel
                              $python -m pip install cryptography==2.3
                              export LC_ALL=en_US.UTF-8
                              $python -m pip install ansible-core==2.11.12
                            else
                              $python -m pip install ansible==6.0.0
                            fi
            
                            # install requirements in virtual env
                            cd $ansible_dir/$repo/ansible
                            $python -m pip install -r requirements.txt
                            ansible-galaxy role install -r requirements.yml
                            ansible-galaxy collection install -r requirements.yml --force
            
                            # run ansible (note comma after localhost is deliberate)
                            ansible-playbook site.yml \
                            --connection=local \
                            --inventory localhost, \
                            --extra-vars "ansible_python_interpreter=$python" \
                            --extra-vars "target=localhost" \
                            --extra-vars "@group_vars/ami_$ami_tag.yml" \
                            --tags amibuild \
                            --become
            
                            # Cleanup
                            deactivate
                            echo "Cleaning up $ansible_dir"
                            rm -rf $ansible_dir/$repo
                            rm -rf $ansible_dir/python-venv
                            rmdir $ansible_dir
                          }
                          echo "ansible base_rhel_7_9 start" | logger -p local3.info -t ami-component
                          run_ansible 2>&1 | logger -p local3.info -t ami-component
                          echo "ansible base_rhel_7_9 end" | logger -p local3.info -t ami-component
        EOT
      + date_created = (known after apply)
      + description  = "Install ansible roles for base_rhel_7_9"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "base_rhel_7_9_ansible"
      + owner        = (known after apply)
      + platform     = "Linux"
      + tags         = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + tags_all     = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + type         = (known after apply)
      + version      = "0.0.1"
    }

  # module.imagebuilder.aws_imagebuilder_component.this["../components/rhel_7_9/packages.yml.tftpl"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: base_rhel_7_9_packages
            description: base_rhel_7_9 component for installing standard packages.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.0.1
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: InstallPackages
                    action: ExecuteBash
                    inputs:
                      commands:
                        - sudo yum install wget curl unzip git nc ca-certificates gcc screen zlib-devel bzip2-devel openssl-devel libffi-devel  -y
        EOT
      + date_created = (known after apply)
      + description  = "base_rhel_7_9 component for installing standard packages."
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "base_rhel_7_9_packages"
      + owner        = (known after apply)
      + platform     = "Linux"
      + tags         = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + tags_all     = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + type         = (known after apply)
      + version      = "0.0.1"
    }

  # module.imagebuilder.aws_imagebuilder_component.this["../components/rhel_7_9/python.yml.tftpl"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: base_rhel_7_9_python
            description: base_rhel_7_9 component for installing python
            schemaVersion: 1.0
            # terraform yamlencode can not deal with cloudformation specific references - falls apart when seeing !Sub,
            # so probably best to put in templated vars from terraform.
            # https://github.com/hashicorp/terraform/issues/26962
            parameters:
              - Version:
                  type: string
                  default: 0.0.1
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: InstallPython3-9-6
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install python
                          wget https://www.python.org/ftp/python/3.9.6/Python-3.9.6.tgz
                          tar xzf Python-3.9.6.tgz
                          rm -f Python-3.9.6.tgz
                          cd Python-3.9.6
            
                          # ensure zlib is enabled, required for some ansible modules
                          sed -i 's/^#zlib/zlib/' Modules/Setup
            
                          ./configure --enable-optimizations
                          sudo make altinstall
            
                  # Install pip
                  - name: InstallPipAndVirtualenv
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          # install pip and virtualenv
                          python3.9 -m pip install --upgrade pip
                          python3.9 -m pip install virtualenv
        EOT
      + date_created = (known after apply)
      + description  = "base_rhel_7_9 component for installing python"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "base_rhel_7_9_python"
      + owner        = (known after apply)
      + platform     = "Linux"
      + tags         = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + tags_all     = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + type         = (known after apply)
      + version      = "0.0.1"
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be created
  + resource "aws_imagebuilder_distribution_configuration" "this" {
      + arn          = (known after apply)
      + date_created = (known after apply)
      + date_updated = (known after apply)
      + description  = "shared rhel 7.9 base image"
      + id           = (known after apply)
      + name         = "base_rhel_7_9"
      + tags         = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + tags_all     = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }

      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "shared rhel 7.9 base image"
      + distribution_configuration_arn   = (known after apply)
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "base_rhel_7_9"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + tags_all                         = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 1 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this will be created
  + resource "aws_imagebuilder_image_recipe" "this" {
      + arn              = (known after apply)
      + date_created     = (known after apply)
      + description      = "shared rhel 7.9 base image"
      + id               = (known after apply)
      + name             = "base_rhel_7_9"
      + owner            = (known after apply)
      + parent_image     = "ami-0c2f9865057c3dfe1"
      + platform         = (known after apply)
      + tags             = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + tags_all         = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + user_data_base64 = (known after apply)
      + version          = "0.0.1"

      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 2
              + volume_type           = "gp3"
            }
        }

      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/update-linux/x.x.x"
        }
      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/stig-build-linux-medium/x.x.x"
        }
      + component {
          + component_arn = (known after apply)
        }
      + component {
          + component_arn = (known after apply)
        }
      + component {
          + component_arn = (known after apply)
        }

      + systems_manager_agent {
          + uninstall_after_build = false
        }
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this will be created
  + resource "aws_imagebuilder_infrastructure_configuration" "this" {
      + arn                           = (known after apply)
      + date_created                  = (known after apply)
      + date_updated                  = (known after apply)
      + description                   = "shared rhel 7.9 base image"
      + id                            = (known after apply)
      + instance_profile_name         = "ImageBuilder"
      + instance_types                = [
          + "t3.medium",
        ]
      + name                          = "base_rhel_7_9_0_0_1"
      + resource_tags                 = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + security_group_ids            = [
          + "sg-0987edc89553585ad",
        ]
      + subnet_id                     = "subnet-014d083e052388b2a"
      + tags                          = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + tags_all                      = {
          + "application"                     = "n/a"
          + "base_rhel_7_9_ansible-version"   = "0.0.1"
          + "base_rhel_7_9_packages-version"  = "0.0.1"
          + "base_rhel_7_9_python-version"    = "0.0.1"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "github-actor"                    = "wullub"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.0.1"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.0.1"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2022.3.2"
          + "update-linux-version"            = "1.0.2"
        }
      + terminate_instance_on_failure = true

      + logging {
          + s3_logs {
              + s3_bucket_name = "ec2-image-builder-logs-20211019134837153100000001"
              + s3_key_prefix  = "base"
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```
